Австралия/src/InformationRegisters/BatchTrackingPolicy/BatchTrackingPolicy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BatchTrackingPolicy</name>
  <resources>
    <name>Policy</name>
    <type>
      <types>CatalogRef.BatchTrackingPolicies</types>
    </type>
  </resources>
  <dimensions>
    <name>BatchSettings</name>
    <type>
      <types>CatalogRef.BatchSettings</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/BatchTrackingMethods/BatchTrackingMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BatchTrackingMethods</name>
  <enumValues>
    <name>FEFO</name>
  </enumValues>
  <enumValues>
    <name>Manual</name>
  </enumValues>
  <enumValues>
    <name>Referential</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/InformationRegisters/BatchTrackingPolicy/Forms/RecordForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If ValueIsFilled(Record.BatchSettings) Then
		UseExpirationDate = Common.ObjectAttributeValue(Record.BatchSettings, "UseExpirationDate");
		SetDefaultTrackingPolicyChoiceParameters(UseExpirationDate);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure BatchSettingsOnChange(Item)
	
	If ValueIsFilled(Record.BatchSettings) Then
		BatchSettingsOnChangeAtServer();
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetDefaultTrackingPolicyChoiceParameters(UseExpirationDate)
	
	If UseExpirationDate Then
		
		Items.Policy.ChoiceParameters = New FixedArray(New Array);
		
	Else
		
		MethodsArray = New Array;
		MethodsArray.Add(Enums.BatchTrackingMethods.Manual);
		MethodsArray.Add(Enums.BatchTrackingMethods.Referential);
		ChoiceParameter = New ChoiceParameter("Filter.TrackingMethod", New FixedArray(MethodsArray));
		ChoiceParametersArray = New Array;
		ChoiceParametersArray.Add(ChoiceParameter);
		Items.Policy.ChoiceParameters = New FixedArray(ChoiceParametersArray);
		
	EndIf;
	
EndProcedure

&AtServer
Procedure BatchSettingsOnChangeAtServer()
	
	BatchSettingsData = Common.ObjectAttributesValues(Record.BatchSettings,
		"UseExpirationDate, DefaultTrackingPolicy");
	
	Record.Policy = BatchSettingsData.DefaultTrackingPolicy;
	
	SetDefaultTrackingPolicyChoiceParameters(BatchSettingsData.UseExpirationDate);
	
EndProcedure

#EndRegion
